# Pandas Case study
We will check data from titanic data Set

<!-- Import Libraries -->

In [2]:
# Import Libraries
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [ ]:
# Loading titanic data set
titanic = sns.load_dataset("titanic")
titanic.head(5)

In [5]:
# Saving Dataframe into csv file
titanic.to_csv("titanic.csv")

In [ ]:
# Basic statistics or summary
titanic.describe()

In [7]:
titanic.head(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
# Dropping few columns and make a new Data Set
new_titanic = titanic.drop(["deck","embarked","alone"], axis = 1)
new_titanic.head()

In [14]:
titanic.mean(numeric_only=1)

survived       0.383838
pclass         2.308642
age           29.699118
sibsp          0.523008
parch          0.381594
fare          32.204208
adult_male     0.602694
alone          0.602694
dtype: float64

In [20]:
titanic.groupby(["sex","class"]).mean(numeric_only= 1)

C:\Users\Ijaz Ullah Khan\AppData\Local\Temp\ipykernel_16612\2972267368.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  titanic.groupby(["sex","class"]).mean(numeric_only= 1)

               survived  pclass        age     sibsp     parch        fare  \
sex    class
female First   0.968085     1.0  34.611765  0.553191  0.457447  106.125798
       Second  0.921053     2.0  28.722973  0.486842  0.605263   21.970121
       Third   0.500000     3.0  21.750000  0.895833  0.798611   16.118810
male   First   0.368852     1.0  41.281386  0.311475  0.278689   67.226127
       Second  0.157407     2.0  30.740707  0.342593  0.222222   19.741782
       Third   0.135447     3.0  26.507589  0.498559  0.224784   12.661633

               adult_male     alone
sex    class
female First     0.000000  0.361702
       Second    0.000000  0.421053
       Third     0.000000  0.416667
male   First     0.975410  0.614754
       Second    0.916667  0.666667
       Third     0.919308  0.760807

In [22]:
titanic.value_counts("survived")

survived
0    549
1    342
Name: count, dtype: int64

In [28]:
titanic.groupby("sex").mean(numeric_only= 1)

,survived,pclass,age,sibsp,parch,fare,adult_male,alone
sex,,,,,,,,
female,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818,0.000000,0.401274
male,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893,0.930676,0.712305

In [36]:
# Children in titanic
children = titanic[titanic["age"] < 18]
children.groupby("sex").mean(numeric_only=1)

,survived,pclass,age,sibsp,parch,fare,adult_male,alone
sex,,,,,,,,
female,0.690909,2.490909,9.236364,1.200000,1.036364,32.782653,0.000000,0.200000
male,0.396552,2.672414,8.856379,1.706897,1.068966,29.739729,0.310345,0.206897